app/Http/Controllers/User/DashboardController.php

select * from `transactions` where `user_id` = 2 order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 2 and `type` = 'REMITTANCE' and `attribute` = 'RECEIVED' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 2 and `type` = 'REMITTANCE' and `attribute` = 'SEND' and `status` = 1
select sum(`amount`) as aggregate from `virtual_cards` where `user_id` = 2
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 2 and `type` = 'BILL-PAY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 2 and `type` = 'MOBILE-TOPUP' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 2 and `type` = 'MONEY-OUT' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 2 and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 2 and `type` = 'ADD-MONEY' and date(`created_at`) = '2024-01-01' and `status` = 2
select count(*) as aggregate from `transactions` where `user_id` = 2 and `type` = 'ADD-MONEY' and date(`created_at`) = '2024-01-01' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 2 and `type` = 'ADD-MONEY' and date(`created_at`) = '2024-01-01' and `status` = 4
select count(*) as aggregate from `transactions` where `user_id` = 2 and `type` = 'ADD-MONEY' and date(`created_at`) = '2024-01-01' and `status` = 3
---
    public function index()
    {
        $page_title =__( "Dashboard");
        $baseCurrency = Currency::default();
        $transactions = Transaction::auth()->latest()->take(5)->get();
        $data['totalReceiveRemittance'] =Transaction::auth()->remitance()->where('attribute',"RECEIVED")->where('status',1)->sum('request_amount');
        $data['totalSendRemittance'] =Transaction::auth()->remitance()->where('attribute',"SEND")->where('status',1)->sum('request_amount');
        $data['cardAmount'] =VirtualCard::where('user_id',auth()->user()->id)->sum('amount');
        $data['billPay'] = Transaction::auth()->billPay()->where('status',1)->sum('request_amount');
        $data['topUps'] = Transaction::auth()->mobileTopup()->where('status',1)->sum('request_amount');
        $data['withdraw'] = Transaction::auth()->moneyOut()->where('status',1)->sum('request_amount');
        $data['toatlTransactions'] = Transaction::auth()->where('status',1)->sum('request_amount');

        $start = strtotime(date('Y-m-01'));
        $end = strtotime(date('Y-m-31'));
          // Add Money
        $pending_data  = [];
        $success_data  = [];
        $canceled_data = [];
        $hold_data     = [];
        $month_day  = [];
        // Money Out
        $Money_out_pending_data  = [];
        $Money_out_success_data  = [];
        $Money_out_canceled_data = [];
        $Money_out_hold_data     = [];
        while ($start <= $end) {
            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $success = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 1)
                                        ->count();
            $canceled = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 4)
                                        ->count();
            $hold = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 3)
                                        ->count();

select count(*) as aggregate from `transactions` where `user_id` = 2 and `type` = 'MONEY-OUT' and date(`created_at`) = '2024-01-01' and `status` = 2
select count(*) as aggregate from `transactions` where `user_id` = 2 and `type` = 'MONEY-OUT' and date(`created_at`) = '2024-01-01' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 2 and `type` = 'MONEY-OUT' and date(`created_at`) = '2024-01-01' and `status` = 4
select count(*) as aggregate from `transactions` where `user_id` = 2 and `type` = 'MONEY-OUT' and date(`created_at`) = '2024-01-01' and `status` = 3
---
            $hold_data[]     = $hold;

              // Monthley money Out
              $money_pending = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $money_success = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                ->whereDate('created_at',$start_date)
                                ->where('status', 1)
                                ->count();
            $money_canceled = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                ->whereDate('created_at',$start_date)
                                ->where('status', 4)
                                ->count();
            $money_hold = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                            ->whereDate('created_at',$start_date)
                            ->where('status', 3)
                            ->count();