app/Http/Controllers/User/PaymentLinkController.php

select * from `merchants` where `merchants`.`id` in (2)
select * from `payment_links` where `status` = 1 and `token` = 'SaRBsugOMmopGQ5EZwbjttBVFv2xgimzH9WUipSzvzUTno9F9l31U26J8cPD' limit 1
select * from `gateway_a_pis` limit 1
---
    public function paymentLinkShare($token){
        $payment_link = PaymentLink::with('user','merchant')->where('status', 1)->where('token', $token)->first();
        if(empty($payment_link)){
            return redirect()->route('index')->with(['error' => [__('Invalid Payment Link')]]);
        }
        $credentials = GatewayAPi::first();

select * from `gateway_a_pis` limit 1
select * from `merchants` where `merchants`.`id` in (2)
select * from `payment_links` where `payment_links`.`id` = '1' limit 1
select * from `users` where 0 = 1
---
    public function paymentLinkSubmit(Request $request){

        $validator = Validator::make($request->all(),[
            'target'     => 'required',
            'email'      => 'required|email',
            'card_name'  => 'required',
            'token'      => 'required',
            'last4_card' => 'required',
            'amount'     => 'required|gt:0',
        ]);

        if($validator->fails()){
            return back()->withErrors($validator)->withInput();
        }

        $validated = $validator->validated();

        $credentials = GatewayAPi::first();
        if(empty($credentials)){
            return back()->with(['error' => [__('Transaction Failed. Record didn\'t saved properly. Please try again')]]);
        }

        $payment_link = PaymentLink::with('user','merchant')->find($validated['target']);

select * from `currencies` where `code` = 'NGN' limit 1
---
            }
        }
        $validated['payment_link'] = $payment_link;
        $receiver_currency = Currency::where('code', $validated['payment_link']->currency)->first();

select * from `currencies` where `currencies`.`id` in (1)
select * from `merchant_wallets` where `merchant_id` = 2 limit 1
select * from `merchants` where `merchants`.`id` in (2)
---
            $receiver_wallet = UserWallet::with('user','currency')->where('user_id', $payment_link->user_id)->first();
            $userType = "USER";
        }elseif($payment_link->merchant_id != null){
            $receiver_wallet = MerchantWallet::with('merchant','currency')->where('merchant_id', $payment_link->merchant_id)->first();

select * from `currencies` where `code` = 'NGN' and `name` = 'Nigerian naira' limit 1
---
            return back()->with(['error' => [__('Receiver wallet not found')]]);
        }

        $sender_currency = Currency::where('code', $payment_link->currency)->where('name', $payment_link->currency_name)->first();

select * from `transaction_settings` where `slug` = 'pay-link' and `status` = 1 limit 1
---
        $validated['sender_currency'] = $sender_currency;
        $validated['transaction_type'] = PaymentGatewayConst::TYPEPAYLINK;

        $payment_link_charge = TransactionSetting::where('slug', PaymentGatewayConst::paylink_slug())->where('status',1)->first();

select * from `payment_links` where `token` = 'SaRBsugOMmopGQ5EZwbjttBVFv2xgimzH9WUipSzvzUTno9F9l31U26J8cPD' limit 1
---
     public function transactionSuccess($token){
        $payment_link = PaymentLink::with('user')->where('token', $token)->first();