app/Http/Controllers/User/SendMoneyController.php

select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 2 and `type` = 'TRANSFER-MONEY' order by `created_at` desc limit 10
---
    public function index() {
        $page_title = __("Send Money");
        $sendMoneyCharge = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $transactions = Transaction::auth()->senMoney()->latest()->take(10)->get();