app/Http/Helpers/helpers.php

function get_admin_notifications()
{
    $notifications = AdminNotification::auth()->where('clear_at',null)->latest()->get();
---
select * from `admin_notifications` where `admin_id` = 1 and `clear_at` is null order by `created_at` desc

function get_user_notifications()
{
    if(auth()->guard('web')->check()){
        $user = auth()->user();
        $notifications = UserNotification::auth()->latest()->take(5)->get();
        return $notifications;
    } else if(auth()->guard('merchant')->check()){
        $user = auth()->user();
        $notifications = MerchantNotification::auth()->latest()->take(5)->get();
---
select * from `user_notifications` where `user_id` = 2 order by `created_at` desc limit 5
select * from `merchant_notifications` where `merchant_id` = 2 order by `created_at` desc limit 5

function selectedLang(){
    $default_language = Language::where('status',GlobalConst::ACTIVE)->first();
---
select * from `languages` where `status` = 1 limit 1

function selectedLangDir(){
    if(session()->get('local')){
    $default_language = Language::where('code',session()->get('local'))->first();
    $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    }else{
        $default_language = Language::where('status',GlobalConst::ACTIVE)->first();
---
select * from `languages` where `code` = 'en' limit 1
select * from `languages` where `status` = 1 limit 1

function authWalletBalance(){
    if(auth()->guard('web')->check()){
        $wallet = UserWallet::where('user_id',auth()->user()->id)->first();
        return number_format($wallet->balance,2);
    }else if(auth()->guard('merchant')->check()){
        $wallet = MerchantWallet::where('merchant_id',auth()->user()->id)->first();
---
select * from `user_wallets` where `user_id` = 2 limit 1
select * from `merchant_wallets` where `merchant_id` = 2 limit 1

function module_access($key,$module = null)
{
    if (!$module) {
        $module = ModuleSetting::query();
    }
    return $module->where('user_type',userGuard()['type'])->where('slug',$key)->first();
---
select * from `module_settings` where `user_type` = 'USER' and `slug` = 'remittance-money' limit 1

function getFlutterwaveBanks($iso2){
    $cardApi = PaymentGateway::where('type',"AUTOMATIC")->where('alias','flutterwave-money-out')->first();
---
select * from `payment_gateways` where `type` = 'AUTOMATIC' and `alias` = 'flutterwave-money-out' limit 1

function flutterwaveBalance($secret_key = null){
    $cardApi = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1

function totalAdminProfits(){

    $total_profits = TransactionCharge::with('transactions')
    ->whereHas('transactions', function ($query) {
        $query->whereNotIn('type', [PaymentGatewayConst::TYPEADDMONEY, PaymentGatewayConst::TYPEMONEYOUT,PaymentGatewayConst::TYPEADDSUBTRACTBALANCE]);
    })
    ->sum('total_charge');
---
select sum(`total_charge`) as aggregate from `transaction_charges` where exists (select * from `transactions` where `transaction_charges`.`transaction_id` = `transactions`.`id` and `type` not in ('ADD-MONEY', 'MONEY-OUT', 'ADD-SUBTRACT-BALANCE'))

function virtual_card_system($name)
{
    $method = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1

function getCurrencyList(){

    $credentials  = GatewayAPi::first();
---
select * from `gateway_a_pis` limit 1