app/Http/Controllers/User/Auth/RegisterController.php

select * from `users` where `email` = 'Knighttut@gmail.com' limit 1
---
    public function sendVerifyCode(Request $request){
        $basic_settings = $this->basic_settings;
        if($basic_settings->agree_policy){
            $agree = 'required';
        }else{
            $agree = '';
        }
        $validator = Validator::make($request->all(),[
            'email'         => 'required|email',
            'agree'         =>  $agree,

        ]);
        $validated = $validator->validate();

        $field_name = "username";
        if(check_email($validated['email'])) {
            $field_name = "email";
        }

        $exist = User::where($field_name,$validated['email'])->first();

select exists(select * from `users` where `full_mobile` = '107062544397') as `exists`
---
    public function register(Request $request)
    {
        $basic_settings             = $this->basic_settings;
        $validated = $this->validator($request->all())->validate();
        if($basic_settings->kyc_verification == true){
            $user_kyc_fields = SetupKyc::userKyc()->first()->fields ?? [];
            $validation_rules = $this->generateValidationRules($user_kyc_fields);
            $kyc_validated = Validator::make($request->all(),$validation_rules)->validate();
            $get_values = $this->registerPlaceValueWithFields($user_kyc_fields,$kyc_validated);
        }

        try{
            $validated['phone_code'] = get_country_phone_code($validated['country']);
        }catch(Exception $e) {
            return $this->breakAuthentication($e->getMessage());
        }

        $validated['mobile']        = remove_speacial_char($validated['phone']);
        $validated['mobile_code']   = remove_speacial_char($validated['phone_code']);
        $complete_phone             = $validated['mobile_code'] . $validated['mobile'];

        if(User::where('full_mobile',$complete_phone)->exists()) {

insert into `users` (`firstname`, `lastname`, `email`, `password`, `mobile`, `mobile_code`, `full_mobile`, `email_verified`, `sms_verified`, `kyc_verified`, `username`, `address`, `updated_at`, `created_at`) values ('Mikel', 'Harder', 'Knighttut@gmail.com', '$2y$10$6Z3aRjVOXx5.4SXYNoSL1OmDF.uYV5NZ1mab.ARLU281SkHDzEZW6', '07062544397', '1', '107062544397', 1, 1, 1, 'mikelharder', '{\"country\":\"United States\",\"city\":\"Ile ife\",\"zip\":\"220216\",\"state\":\"\",\"address\":\"\"}', '2024-01-18 17:48:51', '2024-01-18 17:48:51')
---
    protected function create(array $data)
    {
        return User::create($data);