app/Models/Merchants/Merchant.php

select count(*) as aggregate from `merchant_login_logs` where `merchant_login_logs`.`merchant_id` = 2 and `merchant_login_logs`.`merchant_id` is not null
select * from `merchant_login_logs` where `merchant_login_logs`.`merchant_id` = 2 and `merchant_login_logs`.`merchant_id` is not null
---
    public function getLastLoginAttribute() {
        if($this->loginLogs()->count() > 0) {
            return $this->loginLogs()->get()->last()->created_at->format("H:i A, d M Y");