app/Http/Controllers/SiteController.php

    public function home(){
        $basic_settings = BasicSettings::first();
        $page_title = $basic_settings->site_title??"Home";
        $app_urls = AppSettings::first();
---
select * from `basic_settings` limit 1
select * from `app_settings` limit 1

    public function changeLanguage($lang = null)
    {
        $language = Language::where('code', $lang)->first();
---
select * from `languages` where `code` = 'es' limit 1