app/Http/Controllers/Admin/DashboardController.php

    public function index()
    {
        $page_title = "Dashboard";
        $transactions = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)->latest()->take(5)->get();
        $last_month_start =  date('Y-m-01', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $last_month_end =  date('Y-m-31', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $this_month_start = date('Y-m-01');
        $this_month_end = date('Y-m-d');
        $this_weak = date('Y-m-d', strtotime('-1 week', strtotime(date('Y-m-d'))));
        $this_month = date('Y-m-d', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $this_year = date('Y-m-d', strtotime('-1 year', strtotime(date('Y-m-d'))));

         // Add Money
         $add_money_total_balance = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEADDMONEY)->sum('request_amount');
         $completed_add_money =  Transaction::toBase()
                             ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                             ->where('status', 1)
                             ->sum('request_amount');
         $pending_add_money =  Transaction::toBase()->where('status', 2)
                                             ->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                             ->sum('request_amount');

         if($pending_add_money == 0){
             $add_money_percent = 0;
         }else{
            $add_money_percent = ($completed_add_money / ($completed_add_money + $pending_add_money)) * 100;
         }
         //Money out
         $total_money_out = Transaction::toBase()->where('type', PaymentGatewayConst::TYPEMONEYOUT)->where('status','!=',4)->sum('request_amount');
         $completed_money_out =  Transaction::toBase()
                             ->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                             ->where('status', 1)
                             ->sum('request_amount');
         $pending_money_out =  Transaction::toBase()->where('status', 2)
                                             ->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                             ->sum('request_amount');
---
select * from `transactions` where `type` = 'ADD-MONEY' order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY'
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'ADD-MONEY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'ADD-MONEY'
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'MONEY-OUT' and `status` != 4
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'MONEY-OUT' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'MONEY-OUT'

         }

         //total profits
         $total_profits = TransactionCharge::toBase()->sum('total_charge');

         $this_month_profits = TransactionCharge::toBase()
             ->whereBetween('created_at', [$this_month_start, $this_month_end])
             ->sum('total_charge');

         $last_month_profits = TransactionCharge::toBase()
             ->whereBetween('created_at', [$last_month_start, $last_month_end])
             ->sum('total_charge');
---
select sum(`total_charge`) as aggregate from `transaction_charges`
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '2024-01-01' and '2024-01-18'
select sum(`total_charge`) as aggregate from `transaction_charges` where `created_at` between '2023-12-01' and '2023-12-31'

         }

          //Virtual Cards
          $total_cards = VirtualCard::toBase()->count();

          $active_cards =  VirtualCard::toBase()->where('is_active',1)->count();
          $inactive_cards = VirtualCard::toBase()->where('is_active',0)->count();
---
select count(*) as aggregate from `virtual_cards`
select count(*) as aggregate from `virtual_cards` where `is_active` = 1
select count(*) as aggregate from `virtual_cards` where `is_active` = 0

             $card_perchant = ($active_cards / ($active_cards + $inactive_cards)) * 100;
          }
           //Remittance
         $total_remittance = Transaction::toBase()->where('type', PaymentGatewayConst::SENDREMITTANCE)->where('status','!=',4)->sum('request_amount');
         $completed_remittance =  Transaction::toBase()
                             ->where('type', PaymentGatewayConst::SENDREMITTANCE)
                             ->where('status', 1)
                             ->sum('request_amount');
         $pending_remittance =  Transaction::toBase()->where('status', 2)
                                             ->where('type', PaymentGatewayConst::SENDREMITTANCE)
                                             ->sum('request_amount');
---
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'REMITTANCE' and `status` != 4
select sum(`request_amount`) as aggregate from `transactions` where `type` = 'REMITTANCE' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `status` = 2 and `type` = 'REMITTANCE'

            $remittance_percent = ($completed_remittance / ($completed_remittance + $pending_remittance)) * 100;
         }
           //Users
           $total_users = User::toBase()->count();
---
select count(*) as aggregate from `users`



            //Merchants
            $total_merchants = Merchant::toBase()->count();
---
select count(*) as aggregate from `merchants`

               $merchant_perchant = ($active_merchants / ($active_merchants + $unverified_merchants)) * 100;
            }
            //Support Tikets
            $total_tickets = UserSupportTicket::toBase()->count();
---
select count(*) as aggregate from `user_support_tickets`

            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $success = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 1)
                                        ->count();
            $canceled = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 4)
                                        ->count();
            $hold = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 3)
                                        ->count();
---
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2024-01-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2024-01-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2024-01-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2024-01-01' and `status` = 3

            $hold_data[]     = $hold;

            // Monthley money Out
            $money_pending = Transaction::where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $money_success = Transaction::where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 1)
                                        ->count();
            $money_canceled = Transaction::where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 4)
                                        ->count();
            $money_hold = Transaction::where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 3)
                                        ->count();
---
select count(*) as aggregate from `transactions` where `type` = 'MONEY-OUT' and date(`created_at`) = '2024-01-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'MONEY-OUT' and date(`created_at`) = '2024-01-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'MONEY-OUT' and date(`created_at`) = '2024-01-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'MONEY-OUT' and date(`created_at`) = '2024-01-01' and `status` = 3

            $Money_out_hold_data[]     = $money_hold;

            //Monthley virtual
            $card_pending = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 2)
                        ->count();
            $card_success = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 1)
                        ->count();
            $card_canceled = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 4)
                        ->count();
            $card_hold = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 3)
                        ->count();
---
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2024-01-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2024-01-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2024-01-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2024-01-01' and `status` = 3


            // Event,Campaign,Gallery

            $event = Blog::where('status', 1)
            ->whereDate('created_at',$start_date)
            ->count();
---
select count(*) as aggregate from `blogs` where `status` = 1 and date(`created_at`) = '2024-01-01'

            'hold_data'     => $Money_out_hold_data,
        ];

        $total_user = User::toBase()->count();
        $unverified_user = User::toBase()->where('sms_verified', 0)->count();
        $active_user = User::toBase()->where('status', 1)->count();
        $banned_user = User::toBase()->where('status', 0)->count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `sms_verified` = 0
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0

        $chart_four = [$active_user, $banned_user,$unverified_user,$total_user];

        // Chart for merchant analysis
        $total_merchant = Merchant::toBase()->count();
        $unverified_merchant = Merchant::toBase()->where('sms_verified', 0)->count();
        $active_merchant = Merchant::toBase()->where('status', 1)->count();
        $banned_merchant = Merchant::toBase()->where('status', 0)->count();
---
select count(*) as aggregate from `merchants`
select count(*) as aggregate from `merchants` where `sms_verified` = 0
select count(*) as aggregate from `merchants` where `status` = 1
select count(*) as aggregate from `merchants` where `status` = 0