app/Http/Controllers/Admin/GatewayApiController.php

    public function index()
    {
        $page_title = __('PayLink Api');
        $api = GatewayAPi::first();
---
select * from `gateway_a_pis` limit 1