app/Http/Controllers/Admin/SetupBillPayController.php

select count(*) as aggregate from `transactions` where `type` = 'BILL-PAY'
---
    public function index()
    {
        $page_title = "All Logs";
        $transactions = Transaction::with(
          'user:id,firstname,lastname,email,username,full_mobile',

        )->where('type', PaymentGatewayConst::BILLPAY)->latest()->paginate(20);